stm32-hotspot/STM32H7-LwIP-Examples/STM32H747_Disco_ETH/STM32H747_Disco_ETH.ioc
PJ3.PinAttribute=Free
PJ3.GPIOParameters=GPIO_Label,PinAttribute
RCC.CPU2Freq_Value=200000000
PC3.Locked=true
PI11.Locked=true
PA3.GPIOParameters=GPIO_Label
PI6.GPIO_Label=FMC_D28
PB6.GPIO_Label=HDMI_CEC
PJ6.GPIO_Label=ARD_D9
PJ12.PinAttribute=Free
PC5.Mode=RMII
PB13.Signal=USB_OTG_HS_ULPI_D6
LWIP.CHECKSUM_GEN_ICMP=0
PG13.Signal=ETH_TXD0
PinOutPanel.RotationAngle=0
PE6.GPIO_Label=SAI1_SD_A
PF6.GPIO_Label=QSPI_BK1_IO3
RCC.MCO1PinFreq_Value=64000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
PJ10.Signal=SPI5_MOSI
RCC.AHB4Freq_Value=200000000
PJ10.Locked=true
LWIP.NETMASK_ADDRESS=255.255.255.000
NVIC1.PendSV_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:false
SH.FMC_A12.ConfNb=1
NVIC2.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PJ13.GPIO_Label=PMOD\#12
PK6.PinAttribute=Free
PH5.Signal=FMC_SDNWE
VP_FREERTOS_M7_VS_CMSIS_V2.Signal=FREERTOS_M7_VS_CMSIS_V2
PK4.PinAttribute=Free
PD15.GPIOParameters=GPIO_Label
LWIP.IPParameters=LWIP_DHCP,IP_ADDRESS,NETMASK_ADDRESS,GATEWAY_ADDRESS,CHECKSUM_GEN_ICMP,CHECKSUM_CHECK_ICMP
SH.FMC_D10_DA10.ConfNb=1
RCC.DIVQ3Freq_Value=50390625
PC3.Signal=SPI2_MOSI
SH.FMC_D17.ConfNb=1
PE5.Signal=SAI1_SCK_A
PE10.Locked=true
PF10.GPIO_Label=ARD_A1
PB13.Locked=true
PH10.GPIO_Label=FMC_D18
NVIC2.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PG13.Locked=true
NVIC2.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PB2.Signal=QUADSPI_CLK
PD1.GPIOParameters=GPIO_Label
RCC.DIVM1=5
PG1.GPIOParameters=GPIO_Label
MxDb.Version=DB.6.0.21
PE15.Locked=true
PB0.GPIOParameters=GPIO_Label
PE0.GPIOParameters=GPIO_Label
PA1.GPIOParameters=GPIO_Speed,GPIO_Label,PinAttribute
SH.FMC_D26.0=FMC_D26
PJ1.GPIOParameters=GPIO_Label,PinAttribute
PI6.Signal=FMC_D28
PI3.Signal=FMC_D27
SH.FMC_D15_DA15.ConfNb=1
PJ1.PinAttribute=Free
PF3.Signal=FMC_A3
SH.FMC_D25.ConfNb=1
PJ5.PinAttribute=Free
RCC.DIVR2Freq_Value=50390625
PE10.Signal=FMC_D7_DA7
CORTEX_M7.DisableExec-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_INSTRUCTION_ACCESS_DISABLE
RCC.MCO2PinFreq_Value=400000000
PC8.GPIOParameters=GPIO_Label
PH10.GPIOParameters=GPIO_Label
PF8.GPIOParameters=GPIO_Label
PI8.GPIOParameters=GPIO_Label,PinAttribute
PD11.Locked=true
PG13.GPIOParameters=GPIO_Speed,GPIO_Label,PinAttribute
PJ5.GPIOParameters=GPIO_Label,PinAttribute
PE10.GPIOParameters=GPIO_Label
PJ4.Signal=GPIO_Input
RCC.DFSDMFreq_Value=100000000
PA5.GPIOParameters=GPIO_Label
PB14.GPIOParameters=GPIO_Label,PinAttribute
SH.FMC_A1.0=FMC_A1
PH2.Signal=QUADSPI_BK2_IO0
SH.FMC_SDCLK.0=FMC_SDCLK
RCC.TraceFreq_Value=64000000
RCC.APB4Freq_Value=100000000
FREERTOS_M7.Tasks01=defaultTask,24,256,StartDefaultTask,Default,NULL,Dynamic,NULL,NULL
RCC.CECFreq_Value=32000
RCC.SAI23Freq_Value=400000000
PF14.Signal=FMC_A8
CORTEX_M7.Enable-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_REGION_ENABLE
PI4.GPIOParameters=GPIO_Label
PJ13.GPIOParameters=GPIO_Label,PinAttribute
PB10.GPIOParameters=GPIO_Label
PI11.Signal=USB_OTG_HS_ULPI_DIR
PE10.GPIO_Label=FMC_D7
PH0-OSC_IN\ (PH0).Mode=HSE-External-Clock-Source
SH.FMC_D3_DA3.0=FMC_D3
ProjectManager.CustomerFirmwarePackage=
PC4.GPIOParameters=GPIO_Speed,GPIO_Label,PinAttribute
RCC.SupplySource=PWR_DIRECT_SMPS_SUPPLY
PF4.GPIOParameters=GPIO_Label
PC4.Mode=RMII
LWIP.IP_ADDRESS=192.168.001.010
PI10.GPIO_Label=FMC_D31
PH12.GPIOParameters=GPIO_Label
SH.FMC_A7.ConfNb=1
PH15.Signal=FMC_D23
SH.FMC_A1.ConfNb=1
NVIC1.SavedSystickIrqHandlerGenerated=true
PJ15.GPIOParameters=GPIO_Label,PinAttribute
SH.FMC_D28.0=FMC_D28
PD9.GPIO_Label=FMC_D14
PG9.Locked=true
PG9.Signal=QUADSPI_BK2_IO2
PA9.GPIO_Label=STLINK_RX
RCC.SWPMI1Freq_Value=100000000
PB11.GPIO_Label=ULPI_D4
PD7.Signal=SPDIFRX1_IN0
PD1.Signal=FMC_D3_DA3
PA11.GPIO_Label=PMOD\#1
PF14.GPIO_Label=FMC_A8
LWIP.LWIP_DHCP=0
PC0.Signal=USB_OTG_HS_ULPI_STP
PK2.Locked=true
RCC.QSPIFreq_Value=200000000
PF13.GPIO_Label=FMC_A7
PG13.GPIO_Label=ETH_TXD0
PJ15.PinAttribute=Free
SH.S_TIM8_CH2.0=TIM8_CH2
SH.FMC_A3.0=FMC_A3
RCC.USART234578Freq_Value=100000000
PJ7.Signal=TIM8_CH2N
PA11.Locked=true
PK2.PinAttribute=Free
SH.FMC_D31.ConfNb=1
RCC.SPI123Freq_Value=400000000
SH.FMC_D15_DA15.0=FMC_D15
PC3_C.GPIOParameters=GPIO_Label
NVIC2.ForceEnableDMAVector=true
PA9.Signal=USART1_TX
RCC.DIVN1=160
PB5.Locked=true
CORTEX_M7.BaseAddress-Cortex_Memory_Protection_Unit_Region0_Settings=0x30040000
PI1.Locked=true
PD7.Locked=true
PE9.GPIO_Label=FMC_D6
SH.FMC_D17.0=FMC_D17
PB10.Signal=USB_OTG_HS_ULPI_D3
PG3.PinAttribute=Free
PJ15.Signal=GPIO_Input
PH9.GPIO_Label=FMC_D17
PI9.GPIO_Label=FMC_D30
ProjectManager.LastFirmware=true
PA7.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
Mcu.Pin116=PH9
PI2.GPIOParameters=GPIO_Label
Mcu.Pin117=PH12
PF2.GPIOParameters=GPIO_Label
Mcu.Pin118=PD11
Mcu.Pin119=PA0_C
PI6.Locked=true
VP_SYS_VS_tim6.Signal=SYS_VS_tim6
PK3.PinAttribute=Free
PA1.Mode=RMII
SH.FMC_D20.ConfNb=1
PE15.Signal=FMC_D12_DA12
PE8.Signal=FMC_D5_DA5
PI1.Signal=FMC_D25
RCC.RNGFreq_Value=48000000
PC2.GPIOParameters=GPIO_Label
Mcu.Pin112=PF15
Mcu.Pin113=PE12
Mcu.Pin114=PE15
PF12.Locked=true
Mcu.Pin115=PJ5
PF11.Locked=true
CORTEX_M7.AccessPermission-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_REGION_FULL_ACCESS
Mcu.Pin110=PB2
Mcu.Pin111=PF12
PA9.Locked=true
Mcu.Pin127=PE13
Mcu.Pin128=PH6
SH.ADCx_INP0.ConfNb=1
Mcu.Pin129=PH8
PI0.Locked=true
PE7.Locked=true
SH.FMC_SDNCAS.0=FMC_SDNCAS
PG14.GPIO_Label=QSPI_BK2_IO3
RCC.ProductRev=revV
ProjectManager.FreePins=false
RCC.LPTIM2Freq_Value=100000000
SH.FMC_NBL1.ConfNb=1
PJ1.Locked=true
ProjectManager.UnderRoot=true
PE13.Locked=true
PH14.GPIO_Label=FMC_D22
SH.FMC_D7_DA7.ConfNb=1
Mcu.Pin123=PB1
PJ15.Locked=true
Mcu.Pin124=PF11
Mcu.Pin125=PG0
Mcu.Pin126=PE8
VP_SYS_M4_VS_Systick.Signal=SYS_M4_VS_Systick
PB5.Signal=USB_OTG_HS_ULPI_D7
PG15.GPIOParameters=GPIO_Label
Mcu.Pin120=PA1_C
Mcu.Pin121=PA5
Mcu.Pin122=PC4
PE13.GPIO_Label=FMC_D10
PD11.Signal=QUADSPI_BK1_IO0
SH.FMC_A10.ConfNb=1
ProjectManager.CompilerOptimize=6
SH.FMC_A5.0=FMC_A5
PG11.Mode=RMII
PA11.Signal=SPI2_NSS
PJ7.Locked=true
PK3.GPIO_Label=JOY_DOWN
PH5.Locked=true
LWIP.Version=v2.1.2_Cube
PF8.Locked=true
RCC.LPTIM345Freq_Value=100000000
ProjectManager.ComputerToolchain=false
PF9.Signal=QUADSPI_BK1_IO1
RCC.LTDCFreq_Value=50390625
Mcu.Pin109=PA7
PC3.GPIO_Label=PMOD\#2
PF3.Locked=true
PJ7.GPIOParameters=GPIO_Label
Mcu.Pin105=PD15
PA8.Mode=Clock-out-1
Mcu.Pin106=PD14
Mcu.Pin107=PC2_C
Mcu.Pin108=PC3_C
PE12.GPIOParameters=GPIO_Label
SH.FMC_NBL3.0=FMC_NBL3
PG3.GPIO_Label=DSI_Reset
SH.FMC_D12_DA12.ConfNb=1
RCC.HCLK3ClockFreq_Value=200000000
PD1.Locked=true
PA1_C.PinAttribute=CortexM4
PB0.Signal=USB_OTG_HS_ULPI_D1
Mcu.ContextNb=2
SH.FMC_D19.0=FMC_D19
PA7.GPIOParameters=GPIO_Speed,GPIO_Label,PinAttribute
RCC.CPU2SystikFreq_Value=200000000
PC0.Locked=true
PC1.Signal=ETH_MDC
PB12.GPIOParameters=GPIO_Label
PD7.GPIOParameters=GPIO_Label
PD2.GPIO_Label=SDIO1_CMD
PG7.GPIOParameters=GPIO_Label
PH2.GPIO_Label=QSPI_BK2_IO0
Mcu.Pin101=PB10
Mcu.Pin102=PB11
Mcu.Pin103=PH10
Mcu.Pin104=PH11
Mcu.Pin100=PE11
RCC.DIVQ2Freq_Value=50390625
PK7.Signal=GPIO_Input
PK7.Locked=true
RCC.SAI1Freq_Value=400000000
RCC.CortexFreq_Value=400000000
SH.FMC_A2.ConfNb=1
PG6.Signal=QUADSPI_BK1_NCS
PH14.Locked=true
PI10.GPIOParameters=GPIO_Label
Mcu.UserName=STM32H747XIHx
PD9.GPIOParameters=GPIO_Label
RCC.HPRE=RCC_HCLK_DIV2
PJ9.GPIOParameters=GPIO_Label
PH0-OSC_IN\ (PH0).Locked=true
PC10.Locked=true
PG6.Locked=true
PC10.Signal=SDMMC1_D2
PA1_C.Signal=ADCx_INP1
SH.FMC_NBL0.0=FMC_NBL0
PI13.Locked=true
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true-CortexM7,2-SystemClock_Config-RCC-false-HAL-false-CortexM7,3-MX_FREERTOS_Init-FREERTOS_M7-false-HAL-false-CortexM7,4-MX_LWIP_Init-LWIP-false-HAL-false-CortexM7,0-MX_CORTEX_M7_Init-CORTEX_M7-false-HAL-true-CortexM7,0-MX_CORTEX_M4_Init-CORTEX_M4-false-HAL-true-CortexM4
PC0.GPIOParameters=GPIO_Label
PA2.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PC0.GPIO_Label=ULPI_STP
SH.FMC_D6_DA6.0=FMC_D6
PB0.GPIO_Label=ULPI_D1
PI5.GPIO_Label=FMC_NBL3
PH5.GPIO_Label=FMC_SDNWE
PC13.GPIO_Label=B2 [Wakeup Button]
PK5.GPIO_Label=JOY_RIGHT
PB11.Signal=USB_OTG_HS_ULPI_D4
PI0.GPIOParameters=GPIO_Label
PK5.GPIOParameters=GPIO_Label,PinAttribute
PI14.GPIO_Label=LED3
PE5.GPIOParameters=GPIO_Label
ProjectManager.StackSize=0x400
PI11.GPIOParameters=GPIO_Label
RCC.VCOInput3Freq_Value=781250
PJ6.Locked=true
PJ6.Signal=S_TIM8_CH2
PA12.Locked=true
SH.FMC_A7.0=FMC_A7
PA12.Signal=SPI2_SCK
PH4.GPIOParameters=GPIO_Label
Mcu.UserConstants=
PH7.Locked=true
PI1.GPIOParameters=GPIO_Label
PC1.GPIOParameters=GPIO_Speed,GPIO_Label,PinAttribute
PF5.Locked=true
Mcu.ThirdPartyNb=0
PD11.GPIO_Label=QSPI_BK1_IO0
RCC.HCLKFreq_Value=200000000
Mcu.IPNb=10
RCC.SPDIFRXFreq_Value=400000000
PF11.GPIO_Label=FMC_SDRAS
PF12.Signal=FMC_A6
PD8.GPIOParameters=GPIO_Label
PH15.GPIOParameters=GPIO_Label
Mcu.Pin6=PC10
Mcu.Pin7=PI1
PJ8.GPIOParameters=GPIO_Label
Mcu.Pin8=PI0
Mcu.Pin9=PI7
PI13.Signal=GPIO_Output
PC2_C.Signal=ADC3_INP0
SH.FMC_A10.0=FMC_A10
Mcu.Pin0=PI6
Mcu.Pin1=PI5
Mcu.Pin2=PI4
Mcu.Pin3=PB5
PK3.Locked=true
Mcu.Pin4=PK5
PD10.GPIOParameters=GPIO_Label
Mcu.Pin5=PG9
LWIP0.BSP.condition=
SH.FMC_D8_DA8.0=FMC_D8
PI8.Signal=GPIO_Input
SH.FMC_D2_DA2.0=FMC_D2
PE13.Signal=FMC_D10_DA10
PF7.GPIO_Label=QSPI_BK1_IO2
PI5.Locked=true
PI5.Signal=FMC_NBL3
PI0.Signal=FMC_D24
PI8.PinAttribute=Free
File.Version=6
PA10.GPIO_Label=STLINK_TX
SH.FMC_D5_DA5.ConfNb=1
PH3.GPIOParameters=GPIO_Label
SH.FMC_D2_DA2.ConfNb=1
PG13.Mode=RMII
PK6.GPIOParameters=GPIO_Label,PinAttribute
SH.FMC_SDNRAS.0=FMC_SDNRAS
PE4.Signal=SAI1_FS_A
PE6.GPIOParameters=GPIO_Label
PC2_C.Locked=true
PI12.GPIOParameters=GPIO_Label,PinAttribute
ProjectManager.ProjectName=STM32H747_Disco_ETH
PD7.GPIO_Label=SPDIF_RX0
RCC.APB3Freq_Value=100000000
LWIP0.BSP.component=LAN8742
PA7.Locked=true
PJ9.Signal=UART8_RX
SH.FMC_D0_DA0.0=FMC_D0
RCC.D1PPRE=RCC_APB3_DIV2
PJ12.Signal=GPIO_Output
CORTEX_M7.BaseAddress-Cortex_Memory_Protection_Unit_Region1_Settings=0x30040000
PK0.GPIO_Label=ARD_D13
PA2.GPIO_Label=ETH_MDIO
PD14.Locked=true
PF5.GPIO_Label=FMC_A5
SH.FMC_A9.0=FMC_A9
PJ1.Signal=GPIO_Input
SH.FMC_D4_DA4.0=FMC_D4
PI12.GPIO_Label=LED1
PE0.GPIO_Label=FMC_NBL0
PF5.Signal=FMC_A5
PH3.GPIO_Label=QSPI_BK2_IO1
PH7.Signal=FMC_SDCKE1
PJ3.GPIO_Label=ARD_D2
PK2.GPIO_Label=JOY_SEL
SH.FMC_D19.ConfNb=1
PC4.Locked=true
SH.FMC_D30.0=FMC_D30
PG13.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PF0.Signal=FMC_A0
PI2.GPIO_Label=FMC_D26
SH.FMC_NBL0.ConfNb=1
PC2.GPIO_Label=PMOD\#3
RCC.Tim2OutputFreq_Value=200000000
VP_LWIP_VS_Enabled.Signal=LWIP_VS_Enabled
RCC.DFSDMACLkFreq_Value=400000000
PH14.GPIOParameters=GPIO_Label
SH.FMC_A12.0=FMC_A12
PA2.Locked=true
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
NVIC1.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PE8.GPIOParameters=GPIO_Label
PK2.Signal=GPIO_Input
SH.FMC_A9.ConfNb=1
CORTEX_M7.CPU_ICache=Enabled
NVIC1.TIM6_DAC_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
PA7.Mode=RMII
PC10.GPIO_Label=SDIO1_D2
PH11.Signal=FMC_D19
ProjectManager.NoMain=false
PG3.Signal=GPIO_Output
PG1.Signal=FMC_A11
PG1.Locked=true
PJ0.PinAttribute=Free
RCC.SAI4BFreq_Value=400000000
SH.FMC_SDCLK.ConfNb=1
PI14.PinAttribute=Free
PC4.Signal=ETH_RXD0
PI14.GPIOParameters=GPIO_Label,PinAttribute
NVIC1.PriorityGroup=NVIC_PRIORITYGROUP_4
RCC.D2PPRE2=RCC_APB2_DIV2
RCC.D2PPRE1=RCC_APB1_DIV2
PI10.Signal=FMC_D31
PK0.Locked=true
PI13.GPIOParameters=GPIO_Label,PinAttribute
VP_LWIP_VS_Enabled.Mode=Enabled
LWIP.GATEWAY_ADDRESS=192.168.001.001
NVIC1.ETH_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
PJ9.Locked=true
PE9.GPIOParameters=GPIO_Label
PC14-OSC32_IN\ (OSC32_IN).Locked=true
RCC.DSITXEscFreq_Value=15625000
RCC.SPI6Freq_Value=100000000
PH13.GPIO_Label=FMC_D21
PC8.GPIO_Label=SDIO1_D0
PC12.GPIOParameters=GPIO_Label
SH.FMC_D21.0=FMC_D21
PH8.GPIO_Label=FMC_D16
SH.FMC_NBL3.ConfNb=1
RCC.SPI45Freq_Value=100000000
NVIC1.SVCall_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:false
PE15.GPIO_Label=FMC_D12
PH4.Signal=USB_OTG_HS_ULPI_NXT
PK7.GPIOParameters=GPIO_Label,PinAttribute
ProjectManager.TargetToolchain=STM32CubeIDE
PE7.GPIOParameters=GPIO_Label
SH.FMC_D1_DA1.ConfNb=1
PC14-OSC32_IN\ (OSC32_IN).PinAttribute=CortexM7
PF15.Locked=true
PB2.GPIOParameters=GPIO_Label
PJ9.GPIO_Label=ARD_D0
NVIC1.ForceEnableDMAVector=true
PC15-OSC32_OUT\ (OSC32_OUT).GPIOParameters=GPIO_Label,PinAttribute
PE4.Locked=true
PF2.Signal=FMC_A2
PC4.PinAttribute=CortexM7
PC2.Locked=true
ProjectManager.RegisterCallBack=
PF5.GPIOParameters=GPIO_Label
PH2.GPIOParameters=GPIO_Label
PH11.Locked=true
SH.FMC_D28.ConfNb=1
PE11.Signal=FMC_D8_DA8
LWIP0.BSP.api=BSP_COMPONENT_DRIVER
PK0.Signal=SPI5_SCK
PB1.Locked=true
PG9.GPIO_Label=QSPI_BK2_IO2
PG14.Signal=QUADSPI_BK2_IO3
SH.ADCx_INP0.0=ADC1_INP0
PJ10.GPIO_Label=ARD_D11
PG1.GPIO_Label=FMC_A11
PD11.GPIOParameters=GPIO_Label
RCC.VCOInput1Freq_Value=5000000
PI8.Locked=true
RCC.APB2Freq_Value=100000000
PG4.GPIOParameters=GPIO_Label
SH.FMC_D13_DA13.ConfNb=1
PI3.Locked=true
PC13.GPIOParameters=GPIO_Label
PF10.Signal=ADC3_INP6
PI7.GPIO_Label=FMC_D29
PF15.Signal=FMC_A9
PD14.GPIO_Label=FMC_D0
PF0.Locked=true
PE6.Signal=SAI1_SD_A
PB15.GPIOParameters=GPIO_Label,PinAttribute
PE11.Locked=true
Mcu.Name=STM32H747XIHx
CORTEX_M7.Size-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_REGION_SIZE_32KB
SH.FMC_D23.ConfNb=1
PA2.Signal=ETH_MDIO
CORTEX_M7.AccessPermission-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_REGION_FULL_ACCESS
PD14.Signal=FMC_D0_DA0
PA7.GPIO_Label=ETH_CRS_DV
PG12.Locked=true
LWIP.BSP.number=1
PC14-OSC32_IN\ (OSC32_IN).Signal=RCC_OSC32_IN
PC5.GPIO_Label=ETH_RXD1
SH.FMC_D23.0=FMC_D23
PJ4.Locked=true
NVIC2.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PF6.GPIOParameters=GPIO_Label
PG12.GPIO_Label=ETH_TXD1
PH2.Locked=true
RCC.SAI4AFreq_Value=400000000
PI15.Signal=GPIO_Output
PC15-OSC32_OUT\ (OSC32_OUT).PinAttribute=CortexM7
RCC.DIVQ1Freq_Value=400000000
PC2_C.GPIOParameters=GPIO_Label
PE3.GPIO_Label=SAI1_SD_B
RCC.D3PPRE=RCC_APB4_DIV2
RCC.VCOInput2Freq_Value=781250
RCC.APB1Freq_Value=100000000
PJ11.GPIOParameters=GPIO_Label
PB11.Locked=true
NVIC2.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.DeviceId=STM32H747XIHx
ProjectManager.LibraryCopy=1
PB1.GPIOParameters=GPIO_Label
PJ12.Locked=true
PA7.Signal=ETH_CRS_DV
PF2.GPIO_Label=FMC_A2
isbadioc=false
